nix/nix-presentation.tex
% Created 2019-04-10 Wed 00:02
% Intended LaTeX compiler: pdflatex
\documentclass[smaller]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\mode<beamer>{\usetheme{Darmstadt}\usecolortheme{seahorse}}
\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}
\usetheme{default}
\author{Antoine R. Dumont (@ardumont)}
\date{07/04/2019}
\title{Nix}
\hypersetup{
 pdfauthor={Antoine R. Dumont (@ardumont)},
 pdftitle={Nix},
 pdfkeywords={nix functional declarative},
 pdfsubject={Nix a declarative package manager},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}


\section{purely functional package manager}
\label{sec:org137326a}

Enforces functional approach to package management\\

\begin{block}{Declarative}
Let the machines work or complain!\\
\end{block}

\begin{block}{Lazy}
Only compute and install what you ask for!\\
\end{block}

\begin{block}{Pure}
Idempotency!\\
\end{block}

\section{Expectations}
\label{sec:orgc793fa8}

Same as other package managers:\\

\begin{itemize}
\item install programs/libraries (with a \emph{unified} DSL)\\

\item integrated in a distribution: NixOS\\

\item home-manager: Reproduce your home!\\
\end{itemize}

\section{Pros}
\label{sec:org817aeda}
\begin{itemize}
\item \alert{\alert{\emph{Unified} DSL}}\\
\item \alert{\alert{Multi-user}} support\\
\item \alert{\alert{Source/binary}} model (binary cache, build-farm, hydra, etc\ldots{})\\
\item \alert{\alert{Upgrades/rollback}} environment\\
\item \alert{\alert{No versioning clash}} in dependencies between programs/libraries\\
\item \alert{\alert{Reproducibility}}\\
\item \alert{\alert{Documented}} \href{https://nixos.org/}{(mostly centralized today)}\\
\item \alert{\alert{Community}} (open discussion on tracker/irc, open PR, etc\ldots{})\\
\item \alert{\alert{Tools}}: nix repl, nix search, nix-build, nix-shell, nix-collect-garbage, \ldots{}\\
\end{itemize}

\section{Cons}
\label{sec:org50a6500}

\begin{itemize}
\item \alert{\alert{Steep}} learning curve, quite some new notions (nix-channel,\\
derivation, overlays\ldots{})\\
\item \alert{\alert{Disk Space}} (\(\rightarrow\) \emph{nix-collect-garbage})\\
\item Inconsistency in between environments or within (haskell, python, etc\ldots{})\\
\item Not unified tool interface (nix build vs nix-build?\ldots{})\\
\end{itemize}

\section{Nix sample}
\label{sec:org8a1540f}
\begin{block}{Program}
\begin{verbatim}
{ stdenv, fetchurl }:

stdenv.mkDerivation rec {
  name = "hello-${version}";
  version = "2.10";
  src = fetchurl {
    url = "mirror://gnu/hello/${name}.tar.gz";
    sha256 =  "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kz...";
  };
  doCheck = true;
  meta = with stdenv.lib; {
    description = "Produces a familiar friendly greeting";
    homepage = https://www.gnu.org/software/hello/manual/;
    license = licenses.gpl3Plus;
    maintainers = [ maintainers.eelco ];
    platforms = platforms.all;
  };
}
\end{verbatim}
\end{block}

\begin{block}{Service}
\begin{verbatim}
{ config, lib, pkgs, ... }:

with lib;
let cfg = config.services.xserver.windowManager.fluxbox;
in {
  options = {
    services.xserver.windowManager.fluxbox.enable =
      mkEnableOption "fluxbox";
  };
  config = mkIf cfg.enable {
    services.xserver.windowManager.session = singleton {
      name = "fluxbox";
      start = ''
        ${pkgs.fluxbox}/bin/startfluxbox &
        waitPID=$!
      '';
    };
    environment.systemPackages = [ pkgs.fluxbox ];
  };
}
\end{verbatim}

\hfill\\
\hfill\\
\end{block}

\begin{block}{Library}
TODO\\
\end{block}

\section{Install}
\label{sec:org4ce68b6}

\begin{block}{Imperative}
\begin{verbatim}
$ hello
The program ‘hello’ is currently not installed.
It is provided by several packages. You can install
it by typing one of the following:
  nix-env -iA nixos.hello
...
$ nix-env --install hello
installing 'hello-2.10'
these paths will be fetched (0.04 MiB download, 0.19 MiB
unpacked):
  /nix/store/gdh8165b7rg4y53v64chjys7mbbw89f9-hello-2.10
copying path '/nix/store/gdh8165b7rg4y53v64chjys7mbbw89f9
-hello-2.10'
from 'https://cache.nixos.org'...
building '/nix/store/39c7sm1sn97yd783jyw50bdabq69gfjm-user-
environment.drv'...
created 1656 symlinks in user environment
$ hello
Hello, world!
\end{verbatim}

\hfill\\
\hfill\\
\end{block}

\begin{block}{Declarative}
\begin{block}{nix (with home-manager)}
\begin{verbatim}
home.packages = [ pkgs.hello ];
\end{verbatim}

Then:\\
\begin{verbatim}
home-manager switch
\end{verbatim}
\end{block}

\begin{block}{nixos}
\begin{verbatim}
environment.systemPackages = [ pkgs.hello ];
\end{verbatim}

Then:\\
\begin{verbatim}
sudo nixos-rebuild switch
\end{verbatim}

Note: All users have now access to that program\\
\end{block}
\end{block}

\section{Remove}
\label{sec:orge02497a}
\begin{block}{Imperative}
Remove explicitely from user environment:\\

\begin{verbatim}
$ nix-env --uninstall hello
uninstalling 'hello-2.10'
$ hello
The program ‘hello’ is currently not installed...
\end{verbatim}
\end{block}

\begin{block}{Declarative}
Rollback to previous generation\\

\begin{verbatim}
$ nix-env --rollback
switching from generation 91 to 90
$ hello
The program ‘hello’ is currently not installed...
\end{verbatim}
\end{block}
\end{document}
